<?php
$this->beginContent('//demo/layouts');

/**
 * Властивості розташовані в порядку приорітету встановлення
 */
$this->widget('ext.FileUploader.UploadOneFileWidget',
	array(
	/*
	 * Режим відладки, використовувати під-час підключення загружчика для можливості перегляду системних повідомлень
	 */
	'debug'							 => false,
	/*
	 * Встановлення назв пакетів які повинні бути підключені разом з загружчиком.
	 * Використовується для уникнення дублювання підключень однакових скриптів.
	 * По замовчуванню розраховується на те, що в проекті вже увімкнено 'jquery','bootstrap'.
	 */
	'packagesRegisterClientScript'	 => array( 'jquery', 'bootstrap', 'ui', 'css-js' ),
	#'model'              => $model, // Модель
	#'attribute'          => 'image',// Атрибут
	# або
	'name'							 => 'recordName', // Назва поля
	'value'							 => (isset($_POST['recordName'])) ? $_POST['recordName'] : '', // Значення
	/*
	 * Використання системи тимчасових файлів для ведення історії завантаження і автоматичне
	 * зачищення мусора(файлів) з файлової системи (ВИМИКАТИ В УНІКАЛЬНИХ ВИПАДКАХ)
	 */
	'usingTemporaryFilesHistory'	 => true, //

	/*
	 * Максимальний розмір файлу (використання параметрів PHP). Розмір файлу який буде дозволено завантажувати
	 * за допомогою загружчика
	 */
	'max_size_upload_file' => 0, //

	/*
	 * Дирикторія завантаження, якщо дана директорія не існує в файловій системі, то ввесь шлях буде створний рекурсивно
	 * з встановленням прав доступу 777
	 */
	'dir' => 'images/image', //

	/*
	 * Створення хеш директорій перед назвою файла. ( md5 ). Тобто, створюється хеш шлях типу 93b5/e211/6da8/0836, який
	 * вставляється перед value і після dir. В результаті виходить images/image/93b5/e211/6da8/0836/file.txt
	 * Для кожного нового файлу буде створбватися свій хеш, але якщо файл замінювати на новий то буде використаний
	 * старий хеш, що вже був створений в файловій системі.
	 * Даний хеш також використовується, якщо вказувати інакші шляхи(відмінні від головного фото) для замібів зображення.
	 * По замовчуванню дана функція не використовується і розрахована для каталогів, тощо, де велика кількість файлів.
	 */
	'createHashPath'		 => false,
	'isImage'				 => true, // (bool) Вказуємо що файл являється зображенням
	'fancyboxGallery'		 => true, // (bool) Використовувать fancybox для переляду зображеня (як для одного зображення так і для галереї)
	'editor'				 => true, // (bool) Використовувать редактор для зображень
	'saveOriginal'			 => true, // (bool) Зберегти оригінал файлу (для зображень)
	'originalNameFile'		 => false, // (bool) Залишать оригінальні імена файлів інакше md5
	'translitNameFile'		 => false, // (bool) Транслітеруемо ім*я файлу при збераженні
	'iconvNameFile'			 => false, // (bool) Перетворення ім*я для збереж. в кирилиці
	'extensionFile'			 => array(), // Типи файлів, які можна завантажувати
	'maxWH'					 => array( 2000, 2000 ), // Максимальна ширина і висота для зображ. array( W , H )
	'textCleanBox'			 => 'Перетащите файлы мышкой в эту область или воспользуйтесь кнопкой ниже',
	'textFileBox'			 => '<b>Скачать / Просмотреть</b>',
	'CImageHandlerParams'	 => array( //компонент для обработки изображений
		// Создание превюшек thumb($toWidth, $toHeight, $proportional = true);
		'thumb'			 => array( /* array( 0, 0, 'name_thumb', $path = '', true ), */),
		// Ресайз картинок resize($toWidth, $toHeight, $proportional = true);
		'resize'		 => array( /* array( 0, 0, 'name_thumb', $path = '', true ), */),
		// Превюшка с подгоном размера и обрезкой лишнего adaptiveThumb($width, $height);
		'adaptiveThumb'	 => array( /* array( 0, 0, 'name_thumb', $path = '' ), */),
		// Превюшка с заливкой бекграунда ($toWidth, $toHeight, $backgroundColor));
		'resizeCanvas'	 => array( /* array( 0, 0, 'name_thumb', $path = '', array( 255, 255, 255 ) ), */),
	),
	// Флагі відображення елементів
	'showElements'			 => array(
		'name'	 => true, // Назва файлу
		'weight' => true, // Вага зображення на сервері
		'size'	 => true, // Розміри завантаженого зображення
) ));

$this->endContent();
